# Terraform `environment` `test`
#### Initialization ⚙️`success`
#### Format and Style 🖌`success`
#### Validation 🤖`success`
<details><summary>Validation Output</summary>

```


Warning: Deprecated Resource

  with kubernetes_namespace.dialogporten,
  on k6_tests_rg_namespaces.tf line 6, in resource "kubernetes_namespace" "dialogporten":
   6: resource "kubernetes_namespace" "dialogporten" {

Deprecated; use kubernetes_namespace_v1.

(and 5 more similar warnings elsewhere)
Success! The configuration is valid, but there were some validation warnings
as shown above.


```

</details>

#### Plan 📖`success`

<details><summary>Show Plan</summary>

```

[Lines containing Refreshing state removed]
[Truncated to 120000 bytes! See logoutput for complete plan]
Acquiring state lock. This may take a few moments...
data.azurerm_resource_group.rd_dp_test["dp-be-test-rg"]: Reading...
data.azurerm_log_analytics_workspace.dp_law_test["dp-be-yt01-insightsWorkspace"]: Reading...
data.azurerm_resource_group.rd_dp_test["dp-be-yt01-rg"]: Reading...
data.azurerm_log_analytics_workspace.dp_law_test["dp-be-test-insightsWorkspace"]: Reading...
data.azurerm_resource_group.rg_dp_stag: Reading...
data.azurerm_resource_group.rg_dp_prod: Reading...
data.azurerm_resource_group.rd_dp_test["dp-be-test-rg"]: Read complete after 1s [id=/subscriptions/8a353de8-d81d-468d-a40d-f3574b6bb3f4/resourceGroups/dp-be-test-rg]
data.azurerm_resource_group.rd_dp_test["dp-be-yt01-rg"]: Read complete after 1s [id=/subscriptions/8a353de8-d81d-468d-a40d-f3574b6bb3f4/resourceGroups/dp-be-yt01-rg]
data.azurerm_client_config.current: Reading...
data.azurerm_monitor_data_collection_rule.prometheus: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1jMjE3YTNlYS00MDJmLTQ4ODYtYWNlNS00NzhkYjcyYWI0Yzk7b2JqZWN0SWQ9Y2M3NWExY2MtZDZhMS00NTMwLTgyOGYtODY4MzJjZTkxYjliO3N1YnNjcmlwdGlvbklkPTFjZThlOWFmLWMyZDYtNDRlNy05YzVlLTA5OWEzMDgwNTZmZTt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]
data.azurerm_resource_group.rg_dp_prod: Read complete after 1s [id=/subscriptions/c595f787-450d-4c57-84fa-abc5f95d5459/resourceGroups/dp-be-prod-rg]
data.azurerm_log_analytics_workspace.dp_law_prod: Reading...
data.azurerm_resource_group.rg_studio_dev: Reading...
data.azurerm_log_analytics_workspace.dp_law_test["dp-be-test-insightsWorkspace"]: Read complete after 1s [id=/subscriptions/8a353de8-d81d-468d-a40d-f3574b6bb3f4/resourceGroups/dp-be-test-rg/providers/Microsoft.OperationalInsights/workspaces/dp-be-test-insightsWorkspace]
data.azurerm_resource_group.rg_studio_law_test: Reading...
data.azurerm_log_analytics_workspace.dp_law_test["dp-be-yt01-insightsWorkspace"]: Read complete after 1s [id=/subscriptions/8a353de8-d81d-468d-a40d-f3574b6bb3f4/resourceGroups/dp-be-yt01-rg/providers/Microsoft.OperationalInsights/workspaces/dp-be-yt01-insightsWorkspace]
data.azurerm_resource_group.rg_studio_stag: Reading...
data.azurerm_resource_group.rg_dp_stag: Read complete after 1s [id=/subscriptions/e4926efc-0577-47b3-9c3d-757925630eca/resourceGroups/dp-be-staging-rg]
data.azurerm_log_analytics_workspace.dp_law_stag: Reading...
data.azurerm_resource_group.rg_studio_law_test: Read complete after 1s [id=/subscriptions/971ddbb1-27d0-4cc7-a016-461dab5cec05/resourceGroups/altinn-rg]
data.azurerm_monitor_data_collection_rule.prometheus: Read complete after 1s [id=/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/resourceGroups/MA_k6tests-amw_norwayeast_managed/providers/Microsoft.Insights/dataCollectionRules/k6tests-amw]
data.azurerm_log_analytics_workspace.studio_law_test: Reading...
data.azurerm_resource_group.rg_studio_dev: Read complete after 1s [id=/subscriptions/971ddbb1-27d0-4cc7-a016-461dab5cec05/resourceGroups/studio-dev-rg]
data.azurerm_resource_group.rg_studio_stag: Read complete after 1s [id=/subscriptions/971ddbb1-27d0-4cc7-a016-461dab5cec05/resourceGroups/studio-staging-rg]
data.azurerm_log_analytics_workspace.dp_law_prod: Read complete after 2s [id=/subscriptions/c595f787-450d-4c57-84fa-abc5f95d5459/resourceGroups/dp-be-prod-rg/providers/Microsoft.OperationalInsights/workspaces/dp-be-prod-insightsWorkspace]
data.azurerm_resource_group.rg_studio_prod: Reading...
data.azurerm_resource_group.rg_studio_law_prod: Reading...
data.azurerm_log_analytics_workspace.studio_law_test: Read complete after 1s [id=/subscriptions/971ddbb1-27d0-4cc7-a016-461dab5cec05/resourceGroups/altinn-rg/providers/Microsoft.OperationalInsights/workspaces/altinn-studio-test-log]
data.azurerm_log_analytics_workspace.dp_law_stag: Read complete after 1s [id=/subscriptions/e4926efc-0577-47b3-9c3d-757925630eca/resourceGroups/dp-be-staging-rg/providers/Microsoft.OperationalInsights/workspaces/dp-be-staging-insightsWorkspace]
data.azurerm_resource_group.rg_studio_prod: Read complete after 1s [id=/subscriptions/f66298ed-870c-40e0-bb74-6db89c1a364b/resourceGroups/studio-prod-rg]
data.azurerm_resource_group.rg_studio_law_prod: Read complete after 1s [id=/subscriptions/f66298ed-870c-40e0-bb74-6db89c1a364b/resourceGroups/altinn-rg]
data.azurerm_log_analytics_workspace.studio_law_prod: Reading...
data.azurerm_log_analytics_workspace.studio_law_prod: Read complete after 1s [id=/subscriptions/f66298ed-870c-40e0-bb74-6db89c1a364b/resourceGroups/altinn-rg/providers/Microsoft.OperationalInsights/workspaces/altinn-studio-prod-log]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # azuread_application_federated_identity_credential.loki will be updated in-place
  ~ resource "azuread_application_federated_identity_credential" "loki" {
        id             = "4f0c6266-e74f-4d26-b436-d79883531c84/federatedIdentityCredential/6f1baf51-29f0-4b29-ac97-98d7f311eb48"
      ~ issuer         = "https://norwayeast.oic.prod-aks.azure.com/cd0026d8-283b-4a55-9bfa-d0ef4a8ba21c/3959c3be-9ff5-42a3-8665-6b8c7260a7f4/" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # azuread_application_federated_identity_credential.prometheus will be updated in-place
  ~ resource "azuread_application_federated_identity_credential" "prometheus" {
        id             = "9dac5fba-c9b2-4a98-bb86-9b60b0f449cc/federatedIdentityCredential/79ea2553-675c-48e4-8f51-2fb2f432fb08"
      ~ issuer         = "https://norwayeast.oic.prod-aks.azure.com/cd0026d8-283b-4a55-9bfa-d0ef4a8ba21c/3959c3be-9ff5-42a3-8665-6b8c7260a7f4/" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # azurerm_kubernetes_cluster.k6tests must be replaced
-/+ resource "azurerm_kubernetes_cluster" "k6tests" {
      - azure_policy_enabled                = false -> null
      - cost_analysis_enabled               = false -> null
      ~ current_kubernetes_version          = "1.33.5" -> (known after apply)
      - custom_ca_trust_certificates_base64 = [] -> null
      ~ fqdn                                = "k6tests-cluster-c1qi908a.hcp.norwayeast.azmk8s.io" -> (known after apply)
      - http_application_routing_enabled    = false -> null
      + http_application_routing_zone_name  = (known after apply)
      ~ id                                  = "/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/resourceGroups/k6tests-rg/providers/Microsoft.ContainerService/managedClusters/k6tests-cluster" -> (known after apply)
      - image_cleaner_enabled               = false -> null
      - image_cleaner_interval_hours        = 0 -> null
      ~ kube_admin_config                   = (sensitive value)
      + kube_admin_config_raw               = (sensitive value)
      ~ kube_config                         = (sensitive value)
      ~ kube_config_raw                     = (sensitive value)
      ~ kubernetes_version                  = "1.33.5" -> (known after apply)
        name                                = "k6tests-cluster"
      ~ node_resource_group                 = "MC_k6tests-rg_k6tests-cluster_norwayeast" -> (known after apply)
      ~ node_resource_group_id              = "/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/resourceGroups/MC_k6tests-rg_k6tests-cluster_norwayeast" -> (known after apply)
      ~ oidc_issuer_url                     = "https://norwayeast.oic.prod-aks.azure.com/cd0026d8-283b-4a55-9bfa-d0ef4a8ba21c/3959c3be-9ff5-42a3-8665-6b8c7260a7f4/" -> (known after apply)
      - open_service_mesh_enabled           = false -> null
      ~ portal_fqdn                         = "k6tests-cluster-c1qi908a.portal.hcp.norwayeast.azmk8s.io" -> (known after apply)
      + private_dns_zone_id                 = (known after apply)
      + private_fqdn                        = (known after apply)
      - tags                                = {} -> null
        # (18 unchanged attributes hidden)

      ~ auto_scaler_profile (known after apply)
      - auto_scaler_profile {
          - balance_similar_node_groups                   = false -> null
          - daemonset_eviction_for_empty_nodes_enabled    = false -> null
          - daemonset_eviction_for_occupied_nodes_enabled = true -> null
          - empty_bulk_delete_max                         = "10" -> null
          - expander                                      = "random" -> null
          - ignore_daemonsets_utilization_enabled         = false -> null
          - max_graceful_termination_sec                  = "600" -> null
          - max_node_provisioning_time                    = "15m" -> null
          - max_unready_nodes                             = 3 -> null
          - max_unready_percentage                        = 45 -> null
          - new_pod_scale_up_delay                        = "0s" -> null
          - scale_down_delay_after_add                    = "10m" -> null
          - scale_down_delay_after_delete                 = "10s" -> null
          - scale_down_delay_after_failure                = "3m" -> null
          - scale_down_unneeded                           = "10m" -> null
          - scale_down_unready                            = "20m" -> null
          - scale_down_utilization_threshold              = "0.5" -> null
          - scan_interval                                 = "10s" -> null
          - skip_nodes_with_local_storage                 = false -> null
          - skip_nodes_with_system_pods                   = true -> null
        }

      ~ azure_active_directory_role_based_access_control {
          ~ tenant_id              = "cd0026d8-283b-4a55-9bfa-d0ef4a8ba21c" -> (known after apply)
            # (2 unchanged attributes hidden)
        }

      ~ bootstrap_profile (known after apply)
      - bootstrap_profile {
          - artifact_source       = "Direct" -> null
            # (1 unchanged attribute hidden)
        }

      ~ default_node_pool {
          - fips_enabled                  = false -> null
          - host_encryption_enabled       = false -> null
          ~ kubelet_disk_type             = "OS" -> (known after apply)
          ~ max_pods                      = 250 -> (known after apply)
            name                          = "default"
          ~ node_count                    = 3 -> (known after apply)
          ~ node_labels                   = {} -> (known after apply)
          - node_public_ip_enabled        = false -> null
          - only_critical_addons_enabled  = false -> null
          ~ orchestrator_version          = "1.33.5" -> (known after apply)
          ~ os_disk_size_gb               = 128 -> (known after apply)
          ~ os_sku                        = "Ubuntu" -> (known after apply)
          - tags                          = {} -> null
          + workload_runtime              = (known after apply)
          - zones                         = [] -> null
            # (18 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

      ~ identity {
          - identity_ids = [] -> null
          ~ principal_id = "1a9ab3b3-8532-47f3-8c83-8a9ea481bd3b" -> (known after apply)
          ~ tenant_id    = "cd0026d8-283b-4a55-9bfa-d0ef4a8ba21c" -> (known after apply)
            # (1 unchanged attribute hidden)
        }

      ~ kubelet_identity (known after apply)
      - kubelet_identity {
          - client_id                 = "06e53307-1ed0-48dc-a249-841b70964708" -> null
          - object_id                 = "38ca1267-c9cb-4fe1-be33-53a62c920fff" -> null
          - user_assigned_identity_id = "/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/resourceGroups/MC_k6tests-rg_k6tests-cluster_norwayeast/providers/Microsoft.ManagedIdentity/userAssignedIdentities/k6tests-cluster-agentpool" -> null
        }

      ~ network_profile {
          ~ dns_service_ip      = "10.0.0.10" -> (known after apply)
          ~ ip_versions         = [
              - "IPv4",
            ] -> (known after apply)
          + network_mode        = (known after apply)
          ~ network_plugin      = "azure" -> "kubenet" # forces replacement
          - network_plugin_mode = "overlay" -> null # forces replacement
          + network_policy      = (known after apply)
          ~ pod_cidr            = "10.244.0.0/16" -> (known after apply)
          ~ pod_cidrs           = [
              - "10.244.0.0/16",
            ] -> (known after apply)
          ~ service_cidr        = "10.0.0.0/16" -> (known after apply)
          ~ service_cidrs       = [
              - "10.0.0.0/16",
            ] -> (known after apply)
            # (3 unchanged attributes hidden)

          ~ load_balancer_profile {
              ~ effective_outbound_ips      = [
                  - "/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/resourceGroups/MC_k6tests-rg_k6tests-cluster_norwayeast/providers/Microsoft.Network/publicIPAddresses/b01635db-4110-4665-a453-529b98032ff7",
                ] -> (known after apply)
              ~ idle_timeout_in_minutes     = 0 -> 30
              ~ managed_outbound_ip_count   = 1 -> (known after apply)
              ~ managed_outbound_ipv6_count = 0 -> (known after apply)
              - outbound_ip_address_ids     = [] -> null
              - outbound_ip_prefix_ids      = [] -> null
              ~ outbound_ports_allocated    = 0 -> 5000
                # (1 unchanged attribute hidden)
            }

          ~ nat_gateway_profile (known after apply)
        }

      ~ node_provisioning_profile (known after apply)
      - node_provisioning_profile {
          - default_node_pools = "Auto" -> null
          - mode               = "Manual" -> null
        }

      ~ oms_agent {
          ~ oms_agent_identity              = [] -> (known after apply)
            # (2 unchanged attributes hidden)
        }

      ~ windows_profile (known after apply)
    }

  # azurerm_kubernetes_cluster_node_pool.prometheus must be replaced
-/+ resource "azurerm_kubernetes_cluster_node_pool" "prometheus" {
      - fips_enabled                  = false -> null
      - host_encryption_enabled       = false -> null
      ~ id                            = "/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/resourceGroups/k6tests-rg/providers/Microsoft.ContainerService/managedClusters/k6tests-cluster/agentPools/prometheus" -> (known after apply)
      ~ kubelet_disk_type             = "OS" -> (known after apply)
      ~ kubernetes_cluster_id         = "/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/resourceGroups/k6tests-rg/providers/Microsoft.ContainerService/managedClusters/k6tests-cluster" -> (known after apply) # forces replacement
      - max_count                     = 0 -> null
      ~ max_pods                      = 250 -> (known after apply)
      - min_count                     = 0 -> null
        name                          = "prometheus"
      - node_public_ip_enabled        = false -> null
      ~ orchestrator_version          = "1.33.5" -> (known after apply)
      ~ os_disk_size_gb               = 128 -> (known after apply)
      ~ os_sku                        = "Ubuntu" -> (known after apply)
      - tags                          = {} -> null
      - zones                         = [] -> null
        # (20 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # azurerm_kubernetes_cluster_node_pool.spot must be replaced
-/+ resource "azurerm_kubernetes_cluster_node_pool" "spot" {
      - fips_enabled                  = false -> null
      - host_encryption_enabled       = false -> null
      ~ id                            = "/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/resourceGroups/k6tests-rg/providers/Microsoft.ContainerService/managedClusters/k6tests-cluster/agentPools/spot" -> (known after apply)
      ~ kubelet_disk_type             = "OS" -> (known after apply)
      ~ kubernetes_cluster_id         = "/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/resourceGroups/k6tests-rg/providers/Microsoft.ContainerService/managedClusters/k6tests-cluster" -> (known after apply) # forces replacement
      ~ max_pods                      = 250 -> (known after apply)
        name                          = "spot"
      - node_public_ip_enabled        = false -> null
      ~ orchestrator_version          = "1.33.5" -> (known after apply)
      ~ os_disk_size_gb               = 128 -> (known after apply)
      ~ os_sku                        = "Ubuntu" -> (known after apply)
      - tags                          = {} -> null
      - zones                         = [] -> null
        # (22 unchanged attributes hidden)
    }

  # azurerm_kubernetes_cluster_node_pool.spot1c3g will be created
  + resource "azurerm_kubernetes_cluster_node_pool" "spot1c3g" {
      + auto_scaling_enabled        = true
      + eviction_policy             = "Delete"
      + id                          = (known after apply)
      + kubelet_disk_type           = (known after apply)
      + kubernetes_cluster_id       = (known after apply)
      + max_count                   = 40
      + max_pods                    = (known after apply)
      + min_count                   = 0
      + mode                        = "User"
      + name                        = "spot1c3g"
      + node_count                  = 0
      + node_labels                 = {
          + "kubernetes.azure.com/scalesetpriority" = "spot"
          + "spot1cpu3gbmem"                        = "true"
        }
      + node_taints                 = [
          + "kubernetes.azure.com/scalesetpriority=spot:NoSchedule",
        ]
      + orchestrator_version        = (known after apply)
      + os_disk_size_gb             = (known after apply)
      + os_disk_type                = "Managed"
      + os_sku                      = (known after apply)
      + os_type                     = "Linux"
      + priority                    = "Spot"
      + scale_down_mode             = "Delete"
      + spot_max_price              = -1
      + temporary_name_for_rotation = "tmpd1c3g"
      + ultra_ssd_enabled           = false
      + vm_size                     = "Standard_D1_v2"
    }

  # azurerm_kubernetes_cluster_node_pool.spot2c7g must be replaced
-/+ resource "azurerm_kubernetes_cluster_node_pool" "spot2c7g" {
      - fips_enabled                  = false -> null
      - host_encryption_enabled       = false -> null
      ~ id                            = "/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/resourceGroups/k6tests-rg/providers/Microsoft.ContainerService/managedClusters/k6tests-cluster/agentPools/spot2c7g" -> (known after apply)
      ~ kubelet_disk_type             = "OS" -> (known after apply)
      ~ kubernetes_cluster_id         = "/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/resourceGroups/k6tests-rg/providers/Microsoft.ContainerService/managedClusters/k6tests-cluster" -> (known after apply) # forces replacement
      ~ max_pods                      = 250 -> (known after apply)
        name                          = "spot2c7g"
      - node_public_ip_enabled        = false -> null
      ~ orchestrator_version          = "1.33.5" -> (known after apply)
      ~ os_disk_size_gb               = 128 -> (known after apply)
      ~ os_sku                        = "Ubuntu" -> (known after apply)
      - tags                          = {} -> null
      - zones                         = [] -> null
        # (22 unchanged attributes hidden)
    }

  # azurerm_kubernetes_cluster_node_pool.spot8c28g must be replaced
-/+ resource "azurerm_kubernetes_cluster_node_pool" "spot8c28g" {
      - fips_enabled                  = false -> null
      - host_encryption_enabled       = false -> null
      ~ id                            = "/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/resourceGroups/k6tests-rg/providers/Microsoft.ContainerService/managedClusters/k6tests-cluster/agentPools/spot8c28g" -> (known after apply)
      ~ kubelet_disk_type             = "OS" -> (known after apply)
      ~ kubernetes_cluster_id         = "/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/resourceGroups/k6tests-rg/providers/Microsoft.ContainerService/managedClusters/k6tests-cluster" -> (known after apply) # forces replacement
      ~ max_pods                      = 250 -> (known after apply)
        name                          = "spot8c28g"
      - node_public_ip_enabled        = false -> null
      ~ orchestrator_version          = "1.33.5" -> (known after apply)
      ~ os_disk_size_gb               = 256 -> (known after apply)
      ~ os_sku                        = "Ubuntu" -> (known after apply)
      - tags                          = {} -> null
      - zones                         = [] -> null
        # (22 unchanged attributes hidden)
    }

  # azurerm_monitor_data_collection_rule_association.k6tests must be replaced
-/+ resource "azurerm_monitor_data_collection_rule_association" "k6tests" {
      ~ id                          = "/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/resourceGroups/k6tests-rg/providers/Microsoft.ContainerService/managedClusters/k6tests-cluster/providers/Microsoft.Insights/dataCollectionRuleAssociations/ContainerInsightsExtension" -> (known after apply)
        name                        = "ContainerInsightsExtension"
      ~ target_resource_id          = "/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/resourceGroups/k6tests-rg/providers/Microsoft.ContainerService/managedClusters/k6tests-cluster" -> (known after apply) # forces replacement
        # (3 unchanged attributes hidden)
    }

  # azurerm_role_assignment.azure_kubernetes_service_cluster_user_role must be replaced
-/+ resource "azurerm_role_assignment" "azure_kubernetes_service_cluster_user_role" {
      + condition_version                      = (known after apply)
      ~ id                                     = "/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/resourceGroups/k6tests-rg/providers/Microsoft.ContainerService/managedClusters/k6tests-cluster/providers/Microsoft.Authorization/roleAssignments/6b7d869b-0b57-d248-365f-5f2ac4d59298" -> (known after apply)
      ~ name                                   = "6b7d869b-0b57-d248-365f-5f2ac4d59298" -> (known after apply)
      ~ principal_type                         = "Group" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/providers/Microsoft.Authorization/roleDefinitions/4abbcc35-e782-43d8-92c5-2d3f1bd2253f" -> (known after apply)
      ~ scope                                  = "/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/resourceGroups/k6tests-rg/providers/Microsoft.ContainerService/managedClusters/k6tests-cluster" -> (known after apply) # forces replacement
      + skip_service_principal_aad_check       = (known after apply)
        # (5 unchanged attributes hidden)
    }

Plan: 8 to add, 2 to change, 7 to destroy.

Warning: Deprecated Resource

  with kubernetes_namespace.dialogporten,
  on k6_tests_rg_namespaces.tf line 6, in resource "kubernetes_namespace" "dialogporten":
   6: resource "kubernetes_namespace" "dialogporten" {

Deprecated; use kubernetes_namespace_v1.

(and 5 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan.out

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.out"
Releasing state lock. This may take a few moments...

```

</details>

| Context | Values |
| - | - |
| Pusher | @monteiro-renato |
| Action | `pull_request` |
| Working Directory | `./infrastructure/adminservices-test/altinn-monitor-test-rg` |
| State File | `github.com/altinn/altinn-platform/environments/test/altinn-monitor-test-rg.tfstate` |
| Plan File | `github.com_altinn_altinn-platform_environments_test_altinn-monitor-test-rg.tfstate.tfplan` |